//
// date.js スプライトデータとか
//

// スプライトクラス
class Sprite {
  constructor(x, y, w, h) {
    this.x = x;
    this.y = y;
    this.w = w;
    this.h = h;
  }
}

// スプライト
let sprite = [
  new Sprite(  0,0,46,56),//0,自機　左2
  new Sprite( 46,0,50,56),//1,自機　左
  new Sprite( 96,0,56,56),//2,自機　正面
  new Sprite(152,0,50,56),//3,自機　右1
  new Sprite(202,0,46,56),//4,自機　右2

  new Sprite(10,70,14,20),//5,弾1
  new Sprite(34,68,16,22),//6,弾2
  
  new Sprite(54,64,16,20),//7,敵弾　1-1
  new Sprite(76,68,14,22),//8,敵弾　1-2
  
  new Sprite(15,356,6,6),//9,爆発1
  new Sprite(42,350,12,12),//10,爆発2
  new Sprite(74,358,18,18),//11,爆発3
  new Sprite(6,380,20,22),//12,爆発4
  new Sprite(32,378,26,28),//13,爆発5
  new Sprite(64,376,30,32),//14,爆発6
  
  new Sprite(2,410,40,40),//15,ヒット1
  new Sprite(30,408,40,40),//16,ヒット2
  new Sprite(64,406,40,40),//17,ヒット3
  
  new Sprite(5,90,30,30),//18,黄色1
  new Sprite(30,90,30,30),//19,黄色2
  new Sprite(65,90,30,30),//20,黄色3
  new Sprite(98,90,30,30),//21,黄色4
  new Sprite(130,90,30,30),//22,黄色5
  
  new Sprite(5,123,30,30),//23,ピンク1
  new Sprite(30,123,30,30),//24,ピンク2
  new Sprite(65,123,30,30),//25,ピンク3
  new Sprite(98,123,30,30),//26,ピンク4
  new Sprite(130,123,30,30),//27,ピンク5
  
  new Sprite(5,156,30,30),//28,殻帽ひよこ1
  new Sprite(30,156,30,30),//29,殻帽ひよこ2
  new Sprite(65,156,30,30),//30,殻帽ひよこ3
  new Sprite(98,156,30,30),//31,殻帽ひよこ4
  new Sprite(130,156,30,30),//32,殻帽ひよこ5
  
  new Sprite(5,184,30,30),//33,青グラサン1
  new Sprite(30,184,30,30),//34,青グラサン2
  new Sprite(65,184,30,30),//35,青グラサン3
  new Sprite(98,184,30,30),//36,青グラサン4
  new Sprite(130,184,30,30),//37,青グラサン5
  
  new Sprite(5,218,30,30),//38,たまご1
  new Sprite(30,218,30,30),//39,たまご2
  new Sprite(65,218,30,30),//40,たまご3
  new Sprite(98,218,30,30),//41,たまご4
  new Sprite(130,218,30,30),//42,たまご5
  
  new Sprite(5,250,30,30),//43,にわとり1
  new Sprite(30,250,30,30),//44,にわとり2
  new Sprite(65,250,30,30),//45,にわとり3
  new Sprite(98,250,30,30),//46,にわとり4
  new Sprite(130,250,30,30),//47,にわとり5
  
  new Sprite(5,280,30,30),//48,たまご（2）1
  new Sprite(30,280,30,30),//49,たまご（2）2
  new Sprite(65,280,30,30),//50,たまご（2）3
  new Sprite(98,280,30,30),//51,たまご（2）4
  new Sprite(130,280,30,30),//52,たまご（2）5
  
  new Sprite(160,90,65,75),//53,黄色（中）
  new Sprite(160,166,65,75),//54,ピンク（中）
  new Sprite(160,248,65,75),//55,青グラサン（中）
  
  new Sprite(160,90,65,75),//56,黄色（大）
  new Sprite(160,166,65,75),//57,ピンク（大）
  new Sprite(160,248,65,75),//58,青グラサン（大）
];